---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroModule.GetMacro(System.String)
source: html/c19af6ed-efb5-3d99-859f-5b82b73c3548.htm
---
# Autodesk.Revit.DB.Macros.MacroModule.GetMacro Method

Gets the macro with the give name.

## Syntax (C#)
```csharp
public Macro GetMacro(
	string name
)
```

## Parameters
- **name** (`System.String`) - The macro name.

## Returns
The macro.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null